_posts/2021-09-11-abc207-c-upsolving.html
---
title: abc207 C - Many Segments
tags: AtCoder
---

<div id="outline-container-org2ca33ac" class="outline-2">
<h2 id="org2ca33ac">C - Many Segments</h2>
</div>

<div id="outline-container-orgdce9964" class="outline-2">
<h2 id="orgdce9964">접근하기</h2>
<div class="outline-text-2" id="text-orgdce9964">
<ul class="org-ul">
<li>l, r 중에서 r로 sort함</li>
<li>구간이 서로 겹치는 곳을 찾아서 count하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcb1240" class="outline-2">
<h2 id="orgdcb1240">코드</h2>
<div class="outline-text-2" id="text-orgdcb1240">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">on1</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p2</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">on2</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">pool</span>[2020];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">before</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">after</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (before.p2 - after.p2) &lt; 0;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cmd</span>, <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>,&amp;cmd, &amp;p1, &amp;p2);
        pool[i].p1 = p1; 
        pool[i].p2 = p2; 
        <span style="color: #729fcf; font-weight: bold;">switch</span>(cmd)
        {
        <span style="color: #729fcf; font-weight: bold;">case</span> 1:
            pool[i].on1 = 1; 
            pool[i].on2 = 1; 
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        <span style="color: #729fcf; font-weight: bold;">case</span> 2:
            pool[i].on1 = 1; 
            pool[i].on2 = 0; 
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        <span style="color: #729fcf; font-weight: bold;">case</span> 3:
            pool[i].on1 = 0; 
            pool[i].on2 = 1; 
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        <span style="color: #729fcf; font-weight: bold;">case</span> 4:
            pool[i].on1 = 0; 
            pool[i].on2 = 0; 
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        }
    }
    sort(pool, pool+N, comp);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (i == j) <span style="color: #729fcf; font-weight: bold;">continue</span>;
            <span style="color: #729fcf; font-weight: bold;">if</span> (pool[i].p2 &gt; pool[j].p1) {
                ans++;
            } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (pool[i].p2 == pool[j].p1 &amp;&amp; pool[i].on2 == 1 &amp;&amp; pool[j].on1 == 1) {
                ans++;
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org27f0805" class="outline-2">
<h2 id="org27f0805">문제 링크</h2>
<div class="outline-text-2" id="text-org27f0805">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc207/tasks/abc207_c">https://atcoder.jp/contests/abc207/tasks/abc207_c</a></li>
</ul>
</div>
</div>
